Tekla Open API Reference for Tekla Structures 2025
RebarLegFace Constructor
Overload List
Name | Description
RebarLegFace()
 Initializes a new instance of the RebarLegFace class.
RebarLegFace(Contour)
 Initializes a new instance of the RebarLegFace class using the specified Contour.
Top
See Also
Reference
RebarLegFace Class
Tekla.Structures.Model Namespace